*&---------------------------------------------------------------------*
*& Report ZLOOP_S36_2
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZLOOP_S36_2.

* 화면에서 숫자를 입력받아 1부터 해당 숫자까지 합을 구하는 프로그램을 구현
PARAMETERS pa_input TYPE i. " 숫자를 입력 받음
DATA gv_result TYPE i. " 합을 저장하는 변수

DO pa_input TIMES.

gv_result = gv_result + sy-index. " 1부터 입력받은 숫자까지 반복하여 더해라

ENDDO.

WRITE: '결과: result:', gv_result.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
