*&---------------------------------------------------------------------*
*& Report ZLOOP_S36_3
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZLOOP_S36_3.

* 화면에서 숫자를 입력받아 1부터 해당 숫자까지 합을 구하는 프로그램을 구현
* (추가)홀수의 합을 구하는 프로그램을 구현
PARAMETERS pa_input TYPE i. " 숫자를 입력 받음
DATA gv_result TYPE i. " 합을 저장하는 변수

DO pa_input TIMES.

* sy-index mod 2 = 1.
IF sy-index mod 2 <> 0. " 홀수라면(2로 나누었을 때 나머지가 0이 아니면)

gv_result = gv_result + sy-index. " 1부터 입력받은 숫자까지 반복하여 더해라

ENDIF.

ENDDO.

WRITE: '결과: result:', gv_result.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
