*&---------------------------------------------------------------------*
*& Report ZDIFF_S36
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZDIFF_S36.

* 사용자에게 생일과 오늘 날짜를 입력 받음
PARAMETERS p_birth TYPE d.
PARAMETERS p_today TYPE d.

* 저장할 변수를 만듦
DATA diff TYPE i.

* 오늘 날짜 - 사용자의 생일
diff = p_today - p_birth.

* 결과를 출력
WRITE diff.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
