*&---------------------------------------------------------------------*
*& Report ZMULTI_S36
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZMULTI_S36.

* 화면에서 2개 값을 입력 받아 곱을 계산하는 프로그램을 구하시오
* 최종 결과를 보관할 변수는 정수형 17자리 소수점 2자리 형태로 정의하시오
PARAMETERS: p_num1 TYPE i, p_num2 TYPE i.
DATA p_result TYPE p LENGTH 9 DECIMALS 2.

p_result = p_num1 * p_num2.

WRITE: 'result : ', p_result.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
