*&---------------------------------------------------------------------*
*& Report ZLOOP_S36
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZLOOP_S36.

* 화면에서 인사할 횟수를 입력받아
* 해당 횟수만큼 인사하는 프로그램을 구하시오

PARAMETERS pa_input TYPE i. " 인사할 횟수 입력 변수

DO pa_input TIMES. " 입력받은 횟수 만큼 반복

  WRITE: sy-index, '안녕하세요'. " 앞에 인덱스를 붙여서 출력
  NEW-LINE.

ENDDO.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
