*&---------------------------------------------------------------------*
*& Report ZSYSVARIABLE_S36
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZSYSVARIABLE_S36.

* 현재 날짜, 시간, 로그인한 아이디
WRITE:/ 'Today:', sy-datum.
WRITE:/ 'Current Time:', sy-uzeit.
WRITE:/ 'Login ID:', sy-uname.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
