*&---------------------------------------------------------------------*
*& Report ZGLOBAL_S36
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZGLOBAL_S36.

* 화면에서 제품코드를 입력 받음
PARAMETERS p_code TYPE mara-matnr.

* 변수를 이용해서 변수를 만드는 키워드 LIKE
DATA new_material LIKE p_code.

----------------------------------------------------------------------------------
Extracted by Mass Download version 1.5.5 - E.G.Mellodew. 1998-2024. Sap Release 750
